In [2]:
import pandas as pd
import numpy as np

In [3]:
data =  {'eng':[10,30,50,70,60],
         'kor':[20,40,60,80,75],
         'math':[90,50,20,70,30]}
df = pd.DataFrame(data, index=['a','b','c','d','e'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

### 추가

### 컬럼 추가

In [ ]:
df['test'] = [1,2,3,4,5]  # 컬럼이 有면 수정, 無면 추가

In [14]:
df['eng'] + df['kor']

a     30
b     70
c    110
d    150
e    135
dtype: int64

In [15]:
df['sum'] = df['eng'] + df['kor']

In [20]:
df.insert(1, 'test1',[1,2,3,4,5]) # df.insert(추가할 컬럼인덱스(위치), 추가할 인덱스 명, 추가할 값)

### 행추가

In [27]:
df.loc['f'] = [1,2,3] # 해당 인덱스가 有면 수정, 無면 추가

### 삭제
- drop( index=[부여된인덱스명,...], colums=[부여된컬럼명,....] )

In [ ]:
# df = df.drop( index=['a','c','d'])
# df.drop( index=['a','c','d'], inplace=True) # inplace=True 를 주게 되면 삭제된 값이 바로 반영됨
df.drop( index=['a','c','d'] )

   eng  kor  math
b   30   40    50
e   60   75    30

In [37]:
df.drop( columns=['eng','math'])

   kor
a   20
b   40
c   60
d   80
e   75

In [ ]:
df.drop(index=['a','d'], columns=['kor']) # drop은 행열 모두 삭제 가능

   eng  math
b   30    50
c   50    20
e   60    30

In [ ]:
df.drop(index=['a','d'], axis=0) #axis=0(행) a와 d를 인덱스명으로 인식하여 삭제함

   eng  kor  math
b   30   40    50
c   50   60    20
e   60   75    30

In [ ]:
df.drop(columns=['kor'], axis=1) #axis=1 컬럼으로 인식하여 'kor'을 삭제

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70
e   60    30

### 정렬

In [4]:
df.sort_values(by='math') #기준 컬럼을 必 지정해줘야함

   eng  kor  math
c   50   60    20
e   60   75    30
b   30   40    50
d   70   80    70
a   10   20    90

In [6]:
df.sort_values(by='math', ascending=False) #내림차순

   eng  kor  math
a   10   20    90
d   70   80    70
b   30   40    50
e   60   75    30
c   50   60    20

In [7]:
df.loc['c','kor'] = 40

In [11]:
df.sort_values(by=['kor','math']) # 1차 정렬은 국어로 하고 2차 정렬은 수학으로 정렬

   eng  kor  math
a   10   20    90
c   50   40    20
b   30   40    50
e   60   75    30
d   70   80    70

In [21]:
df.sort_index(ascending=False) #내림차순

   eng  kor  math
e   60   75    30
d   70   80    70
c   50   40    20
b   30   40    50
a   10   20    90

In [ ]:
df.sort_index(axis=1, ascending=False) #인덱스를 컬럼 정렬해서 알파벳 역순으로 정렬

   math  kor  eng
a    90   20   10
b    50   40   30
c    20   40   50
d    70   80   70
e    30   75   60

In [8]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   40    20
d   70   80    70
e   60   75    30